# Pandas II - Data Cleaning

_October 29, 2020_

Agenda today:
- Introduction to lambda function
- Introduction to data cleaning in pandas
- Combining DataFrames
- Optional Exercises

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Part I. Lambda function
lambda functions are known as anonymous functions in Python. It allows you to write one-line functions that are used together with `map()`, `filter()`.

Syntax of lambda function: `lambda arguments:expressions`.

In [2]:
# lambda function with one argument

# add 10 to any number
(lambda x:x+10)(10)

20

In [3]:
# lambda function with multiple arguments
(lambda x,y,z:x+y+z)(1,2,3)

6

In [4]:
# chain it with conditionals
lambda x:x+10 if x>10 else x

In [7]:
#use it with map and filter

#map(function, collection)
list(map(lambda x:x+10, [1,2,3]))

[11, 12, 13]

In [10]:
#filter(function, collection)

list(filter(lambda x:x>5, [1,6,4]))

[6]

In [18]:
# exercise: turn the below function into a lambda function
def count_zeros(li):
    """
    return a count of how many zeros are in a list
    """
    count = sum(x == 0 for x in li)
    return count

count_zeros

In [12]:
count_zeros([1,0,0,0,2,4,6])

3

In [20]:
sum(map(lambda x:1 if x == 0 else 0, [1,0,1,10,0]))

2

In [19]:
len(list(filter(lambda x:x==0, [1,0, 1,1,0,0,0])))

4

## Part II. Data Cleaning in Pandas
You might wonder what the usage of lambda functions are - they are incredibly useful when applied to data cleaning in Pandas. You can apply it to columns or the entire dataframe to get results you need. For example, you might want to convert a column with $USD to Euros, or temperature expressed in Celsius to Fehrenheit. You will learn three new functions:

- `Apply()` - on both series and dataframe

- `Applymap()` - only on dataframes

- `Map()` - only on series

In [26]:
# import the dataframe 
df = pd.read_csv('auto-mpg.csv')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [22]:
#this method keeps the data in the table but changes '?' to '0'
df=df.replace('?',0)

In [25]:
#this method deletes entries that have '?'
df = df[df.horsepower != '?']
df['horsepower'] = df.horsepower.astype('int')

In [27]:
# examine the first few rows of it 
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
dtype: object

In [34]:
# check the datatypes of the df
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year        int64
origin            int64
car name         object
usable?          object
dtype: object

In [35]:
# check whether you have missing values
df.isna().sum().any()

False

In [ ]:
# creating new columns - broadcasting (string is broadcasted to every single row but doesn't deal with conditionals)
df['usable?'] = 'Yes'

In [37]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,usable?
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,Yes
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,Yes
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,Yes
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,Yes
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,Yes

In [ ]:
# check the dataframe

In [47]:
# time to use lambda and apply! with apply, applymap, and map, you never need to "iterate through the rows"

# create a function that takes in the weight as lbs, and return weight in tons 

# 1 lb = 0.0005
df['weight_in_tons']= df['weight'].apply(lambda x:x*0.0005)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,usable?,weight_in_tons,weight_in_tons_bc
0,18.0,8,307.0,130,0.0005,12.0,70,1,chevrolet chevelle malibu,Yes,2.500000e-07,2.500000e-07
1,15.0,8,350.0,165,0.0005,11.5,70,1,buick skylark 320,Yes,2.500000e-07,2.500000e-07
2,18.0,8,318.0,150,0.0005,11.0,70,1,plymouth satellite,Yes,2.500000e-07,2.500000e-07
3,16.0,8,304.0,150,0.0005,12.0,70,1,amc rebel sst,Yes,2.500000e-07,2.500000e-07
4,17.0,8,302.0,140,0.0005,10.5,70,1,ford torino,Yes,2.500000e-07,2.500000e-07

In [48]:
#broadcasting

df['weight_in_tons_bc'] = df['weight'] * 0.0005

In [49]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,usable?,weight_in_tons,weight_in_tons_bc
0,18.0,8,307.0,130,0.0005,12.0,70,1,chevrolet chevelle malibu,Yes,2.500000e-07,2.500000e-07
1,15.0,8,350.0,165,0.0005,11.5,70,1,buick skylark 320,Yes,2.500000e-07,2.500000e-07
2,18.0,8,318.0,150,0.0005,11.0,70,1,plymouth satellite,Yes,2.500000e-07,2.500000e-07
3,16.0,8,304.0,150,0.0005,12.0,70,1,amc rebel sst,Yes,2.500000e-07,2.500000e-07
4,17.0,8,302.0,140,0.0005,10.5,70,1,ford torino,Yes,2.500000e-07,2.500000e-07

In [50]:
# exercise - create a new column called "years old", which determines how old a car is 
df['years old'] = 120 - df['model year']

In [51]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,usable?,weight_in_tons,weight_in_tons_bc,years old
0,18.0,8,307.0,130,0.0005,12.0,70,1,chevrolet chevelle malibu,Yes,2.500000e-07,2.500000e-07,50
1,15.0,8,350.0,165,0.0005,11.5,70,1,buick skylark 320,Yes,2.500000e-07,2.500000e-07,50
2,18.0,8,318.0,150,0.0005,11.0,70,1,plymouth satellite,Yes,2.500000e-07,2.500000e-07,50
3,16.0,8,304.0,150,0.0005,12.0,70,1,amc rebel sst,Yes,2.500000e-07,2.500000e-07,50
4,17.0,8,302.0,140,0.0005,10.5,70,1,ford torino,Yes,2.500000e-07,2.500000e-07,50

## Part III. Combining DataFrames in Pandas
There are two methods in Pandas that allow us to combine our DataFrames:

    - df.merge() - allow us to match dataframes on either indices or columns
    - df.concat() - allow us to concatenate two dataframes vertically or horizontally

In [57]:
# create some toy dataframes 
small_grades = pd.DataFrame({"students":["Sandra","Billy","Alan"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_quiz = pd.DataFrame({"students":["Alan","Steven","Davida"],
                            "quiz_score":np.random.randint(0,10,3)})

In [58]:
print(small_grades)
print(small_quiz)

  students  projects  grades
0   Sandra         1      91
1    Billy         2      86
2     Alan         1      89
  students  quiz_score
0     Alan           8
1   Steven           5
2   Davida           2

In [60]:
### df.concat 
combined = pd.concat([small_grades, small_quiz], axis = 0)

In [61]:
combined

  students  projects  grades  quiz_score
0   Sandra       1.0    91.0         NaN
1    Billy       2.0    86.0         NaN
2     Alan       1.0    89.0         NaN
0     Alan       NaN     NaN         8.0
1   Steven       NaN     NaN         5.0
2   Davida       NaN     NaN         2.0

<img src = 'sql-joins.png' width = 400>

Based on the diagram above, what are the differences of different types of merge?

In [62]:
### df.merge

# inner merge

small_grades.merge(small_quiz, on = 'students')

  students  projects  grades  quiz_score
0     Alan         1      89           8

In [64]:
# outer merge is the same as full

small_grades.merge(small_quiz, how = 'outer', on = 'students')

  students  projects  grades  quiz_score
0   Sandra       1.0    91.0         NaN
1    Billy       2.0    86.0         NaN
2     Alan       1.0    89.0         8.0
3   Steven       NaN     NaN         5.0
4   Davida       NaN     NaN         2.0

In [65]:
# right merge (its all of the entries in the right table. Alan is in both the left and the right Steven and Davida is just in the right table)

small_grades.merge(small_quiz, how = 'right', on = 'students')

  students  projects  grades  quiz_score
0     Alan       1.0    89.0           8
1   Steven       NaN     NaN           5
2   Davida       NaN     NaN           2

### Data Cleaning - level up with the adult dataset

Dataset documentation:
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

In [ ]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'
adults = pd.read_csv(url,header = None)

In [ ]:
adults.head()

In [ ]:
# Check the first few rows

In [ ]:
# add the columns to dataset
columns = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital_status','occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country','income']

In [ ]:
# check the info of dataset

In [ ]:
# check missing values

In [ ]:
# perform some queries - find the total num female & bachelors

In [ ]:
# seems like we have data anolmaly, find out what that is and fix it 
# hint - tons of entries contain white space, remove it!

In [ ]:
# subsetting multiple cols

In [ ]:
# create a column called income_binary, 1 if >50k and 0 otherwise

In [ ]:
# get some descriptive statistics of the income distribution